import z from "zod";

export const CourseSchema = z.object({
  category: z
    .string()
    .trim()
    .min(3, " دسته بندی باید حداقل ۳ حرف داشته باشد ")
    .max(30, "دسته بندی نمی‌تواند بیشتر از ۳۰ حرف باشد"),
  desc: z
    .string()
    .trim()
    .min(3, "توضیحات باید حداقل ۳ حرف داشته باشد")
    .max(30, "توضیحات نمی‌تواند بیشتر از ۳۰ حرف باشد"),
  discount: z.number({ error: "سن باید یک عدد باشد" }),

  price: z
    .number({ error: "مبلغ باید یک عدد باشد" })
    .min(1, "مبلغ باید حداقل ۱ باشد"),

  registersCount: z
    .number({ error: "تعداد باید یک عدد باشد" })
    .min(1, "تعداد باید حداقل ۱ باشد"),
  // .max(120, "تعداد نمی‌تواند بیشتر از ۱۲۰ باشد"),
  title: z
    .string()
    .trim()
    .min(3, " عنوان  باید حداقل ۳ حرف داشته باشد ")
    .max(30, " عنوان نمی‌تواند بیشتر از ۳۰ حرف باشد"),
});
