import { z } from "zod";
export const UserSchema = z.object({
  firstname: z
    .string()
    .trim()
    .min(3, "نام باید حداقل ۳ حرف داشته باشد")
    .max(30, "نام نمی‌تواند بیشتر از ۳۰ حرف باشد"),
  lastname: z
    .string()
    .trim()
    .min(3, "نام خانوادگی باید حداقل ۳ حرف داشته باشد")
    .max(30, "نام خانوادگی نمی‌تواند بیشتر از ۳۰ حرف باشد"),
  username: z
    .string()
    .trim()
    .min(3, "نام کاربری باید حداقل ۳ حرف داشته باشد")
    .max(30, "نام کاربری نمی‌تواند بیشتر از ۳۰ حرف باشد"),
  email: z.email("لطفاً یک ایمیل معتبر وارد کنید"),
  age: z
    .number({ error: "سن باید یک عدد باشد" })
    .min(1, "سن باید حداقل ۱ باشد")
    .max(120, "سن نمی‌تواند بیشتر از ۱۲۰ باشد"),
  city: z
    .string()
    .trim()
    .min(3, "شهر باید حداقل ۳ حرف داشته باشد")
    .max(30, "نام شهر نمی‌تواند بیشتر از ۳۰ حرف باشد"),
});
